In [10]:
# Importing the libraries
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
import matplotlib.pyplot as plt
import seaborn as sns
from collections import Counter
import re
import string
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.feature_extraction.text import TfidfVectorizer
import warnings
warnings.filterwarnings('ignore')
from sqlalchemy import create_engine

In [4]:
# Loading the dataset
df = pd.read_csv('./worldcities.csv')
df.head()

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629

In [7]:
df.columns.tolist()

['city',
 'city_ascii',
 'lat',
 'lng',
 'country',
 'iso2',
 'iso3',
 'admin_name',
 'capital',
 'population',
 'id']

In [8]:
res = ['city', 'lat', 'lng', 'iso3']

In [9]:
filtereddf = df[res]
filtereddf

                   city      lat       lng iso3
0                 Tokyo  35.6897  139.6922  JPN
1               Jakarta  -6.1750  106.8275  IDN
2                 Delhi  28.6100   77.2300  IND
3             Guangzhou  23.1300  113.2600  CHN
4                Mumbai  19.0761   72.8775  IND
...                 ...      ...       ...  ...
47863        Munha-dong  39.3813  127.2517  PRK
47864            Sil-li  39.4880  125.4640  PRK
47865              Muan  34.9897  126.4714  KOR
47866         Hongseong  36.6009  126.6650  KOR
47867  Charlotte Amalie  18.3420  -64.9331  VIR

[47868 rows x 4 columns]

In [11]:
engine = create_engine('sqlite://', echo=False)

In [12]:
filtereddf.to_sql('location_data', con=engine)

47868

In [13]:
#print(engine.execute('SELECT * FROM location_data').fetchall())

AttributeError: 'Engine' object has no attribute 'execute'